# CircuitNamingScheme Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CircuitNamingScheme Class
Members See Also
---
This class represents a circuit naming scheme in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public class CircuitNamingScheme : Element
```

Visual Basic
---
```text
Public Class CircuitNamingScheme _
	Inherits Element
```

Visual C++
---
```text
public ref class CircuitNamingScheme : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Electrical..::..CircuitNamingScheme
# See Also
CircuitNamingScheme Members
Autodesk.Revit.DB.Electrical Namespace